<?php

namespace Faker\Provider\be_BY;

class Person extends \Faker\Provider\Person
{
    protected static $maleNameFormats = array(
        '{{lastName}} {{firstNameMale}} {{middleNameMale}}',
    );

    /**
     * This provider uses wikipedia's 250 top russian last names
     * That list of MALE last names could be safely extended to FEMALE list just by adding 'a' letter at the end
     */
    protected static $femaleNameFormats = array(
        '{{lastName}} {{firstNameFemale}} {{middleNameFemale}}',
    );

    /**
     * {@link} http://ru.wikipedia.org/wiki/%D0%A0%D1%83%D1%81%D1%81%D0%BA%D0%BE%D0%B5_%D0%BB%D0%B8%D1%87%D0%BD%D0%BE%D0%B5_%D0%B8%D0%BC%D1%8F
     * {@link} http://masterrussian.com/aa031701a.shtml
     **/
    protected static $firstNameMale = array(
        'Абакум', 'Аверкій', 'Авяр’ян', 'Агапон', 'Адам', 'Адрыян', 'Азар', 'Алесь', 'Алізар', 'Альберт', 'Альгерд', 'Аляксандр', 'Аляксей', 'Амвросій',
        'Амос', 'Амяльян', 'Анань', 'Анастас', 'Анатоль', 'Андронік', 'Андрэй', 'Анікей', 'Анісім', 'Анісь', 'Антанін', 'Антон', 'Анупрэй', 'Анціп',
        'Апалінар', 'Апанас', 'Аркадзь', 'Арон', 'Арсень', 'Артур', 'Архіп', 'Арцём', 'Арэст', 'Астап', 'Аўгуст', 'Аўгусцін', 'Аўдакім', 'Аўдзей',
        'Аўксенцій', 'Аўлас', 'Аўрэль', 'Аўсей', 'Ахрэм', 'Багдан', 'Багуслаў', 'Базыль', 'Баляслаў', 'Баніфацый', 'Барыс', 'Барыслаў', 'Баўтрамей',
        'Бенедыкт', 'Бернард', 'Бернардын', 'Браніслаў', 'Брачыслаў', 'Вавіла', 'Вадзім', 'Валерый', 'Валянцін', 'Ваніфат', 'Варлам', 'Варфаламей',
        'Васіль', 'Вацлаў', 'Веніямін', 'Венядзікт', 'Віктар', 'Віктарын', 'Вісарыён', 'Віт', 'Віталь', 'Вітаўт', 'Восіп', 'Вышаслаў', 'Вячаслаў',
        'Галакціён', 'Гарасім', 'Гардзей', 'Гардзіслаў', 'Генадзь', 'Генрык', 'Георгій', 'Геранім', 'Гервась', 'Герман', 'Гіпаліт', 'Глеб', 'Грыгор',
        'Гурый', 'Давыд', 'Далмат', 'Дамінік', 'Данат', 'Даніла', 'Дарафей', 'Дасіфей', 'Даўмонт', 'Дзмітрый', 'Дзям’ян', 'Дзямід', 'Дзяніс', 'Елізар',
        'Елісей', 'Емяльян', 'Ерамей', 'Еранім', 'Ерафей', 'Еўдакім', 'Засім', 'Захар', 'Зіновій', 'Зыгмунт', 'Зянон', 'Іван', 'Ігар', 'Ігнат', 'Ізяслаў',
        'Іларыён', 'Іларый', 'Ілья', 'Інакент', 'Іпаліт', 'Ірыней', 'Ісай', 'Ісак', 'Казімір', 'Калінік', 'Калістрат', 'Каміл', 'Кандрат', 'Канстанцін',
        'Карп', 'Кастусь', 'Касьян', 'Кашпар', 'Кіпрыян', 'Кір', 'Кірык', 'Кірыл', 'Клаўдзій', 'Клім', 'Конан', 'Крысціян', 'Крыштаф', 'Ксавер', 'Ксенафонт',
        'Кузьма', 'Купрыян', 'Лазар', 'Лаўрын', 'Леанард', 'Леанід', 'Леў', 'Лук’ян', 'Лука', 'Людвік', 'Лявон', 'Мадэст', 'Майсей', 'Макар', 'Максім',
        'Максімільян', 'Мануіл', 'Марк', 'Маркел', 'Маркіян', 'Мечыслаў', 'Мікалай', 'Мікіта', 'Міраслаў', 'Мірон', 'Мітрафан', 'Міхаіл', 'Міхей',
        'Мсціслаў', 'Мялент', 'Мяфодзій', 'Навум', 'Назар', 'Нестар', 'Нікадым', 'Нікан', 'Ніканор', 'Ніл', 'Нічыпар',
         'Павел', 'Палікарп', 'Памфіл', 'Панкрат', 'Панцеляймон', 'Парфен', 'Парфір', 'Патап', 'Пафнуцій', 'Пахом', 'Пётр', 'Піліп',
        'Піман', 'Піцірым', 'Платон', 'Пракоп', 'Пратас', 'Прохар', 'Пятро', 'Рагвалод', 'Радаслаў', 'Радзівон', 'Радзім', 'Раман',
        'Расціслаў', 'Рафал', 'Роберт', 'Руслан', 'Руф', 'Рыгор', 'Рышард', 'Сава', 'Савацей', 'Саламон', 'Самсон', 'Сахрон', 'Свірыд',
        'Святаполк', 'Святаслаў', 'Севасцян', 'Северыян', 'Севярын', 'Серафім', 'Сідар', 'Сіла', 'Сільван', 'Сільвестр', 'Спірыдон', 'Станіслаў',
        'Сцяпан', 'Сымон', 'Сявір', 'Сяргей', 'Тадзей', 'Тарас', 'Теактыст', 'Тодар', 'Трыфан', 'Уладзімір', 'Уладзіслаў', 'Улас', 'Ульян',
        'Урбан', 'Усевалад', 'Усцін', 'Усяслаў', 'Фабіян', 'Фадзей', 'Фама', 'Фаўст', 'Фаўстын', 'Феакціст', 'Феафан', 'Феафіл', 'Фёдар',
        'Фелікс', 'Феліцыян', 'Філарэт', 'Філімон', 'Фларыян', 'Фоцій', 'Фядот', 'Фядул', 'Хадзей', 'Халімон', 'Харлам', 'Харытон', 'Хведар',
        'Хвіліп', 'Хвядос', 'Хвядот', 'Хрол', 'Хрысанф', 'Хрыстафор', 'Хрысціян', 'Ягор', 'Якант', 'Якім', 'Якуб', 'Ялісей', 'Ямяльян', 'Ян',
        'Януар', 'Яраполк', 'Яраслаў', 'Яронім', 'Ярэма', 'Яўген', 'Яўлампій', 'Яўсей', 'Яўстах', 'Яўхім', 'Яўціхій'
    );

    /**
     * {@link} http://masterrussian.com/aa031001a.shtml
     **/
    protected static $firstNameFemale = array(
        'Аглаіда','Агнія','Агрыпіна','Ада','Адэлаіда','Акіліна','Аксіння','Алла','Алёна','Алеся','Алімпіяда','Аліна','Аліса','Альбіна','Альжбета',
        'Аляксандра','Анастасія','Ангеліна','Анжэла','Анжэліка','Анісся','Анна','Антаніна','Антонія','Анфіса','Арыядна','Аўгіння',
        'Аўгуста','Аўгусціна','Аўдоцця','Багдана','Баляслава','Барбара','Браніслава','Валерыя','Валянціна','Ванда','Варвара','Васіліна',
        'Васіліса','Вера','Вераніка','Віктарына','Вікторыя','Віялета','Вольга','Вульяна','Галіна','Ганна','Гардзіслава','Гелена','Глафіра',
        'Глікерыя','Гражына','Грыпіна','Дамініка','Данута','Дарафея', "Дар'я",'Дзiана','Домна','Ева','Елізавета','Еўдакія',
        'Еўпраксія','Еўфрасіння','Жана','Зінаіда','Зіновія','Зоя','Іна','Ірына','Казіміра','Калерыя','Каміла','Канстанцыя','Караліна',
        'Кацярына','Кіра','Клара','Клаўдзія','Крысціна','Ксенія','Ларыса','Лідзія','Ліна',"Лукер'я",'Любоў','Людвіка','Людміла',
        'Магда','Магдалена','Макрына','Малання','Маргарыта','Маркела','Марта','Марціна','Марына','Марыя',"Мар'яна",'Матрона','Маўра',
        'Мелентина','Мечыслава','Міраслава','Міхаліна','Настасся','Наталля','Ніка','Ніна','Нона','Паліна','Параскева','Паўла','Паўліна',
        'Пелагея','Праскоўя','Прузына','Пульхерыя','Рагнеда','Рада','Радаслава','Раіна','Раіса','Ружа','Ружана','Руфіна','Сафія','Святлана',
        'Серафіма','Станіслава','Стэфанія','Сузана','Сцяпаніда','Тадора','Таісія','Тамара','Таццяна','Тэкля','Тэрэза','Уладзіслава','Ульяна',
        'Усціння','Фаіна','Фаціння','Фларыяна','Фядора','Фядосся','Фяўроння','Харыціна','Хвядора','Хвядосся','Хрысціна','Ядвіга','Яна','Яніна',
        'Ярміла','Яўгенія','Яўлампія','Яўхімія',
    );

    protected static $middleNameMale = array(
        'Аляксандравіч', 'Аляксеявіч', 'Андрэявіч', 'Дзмітрыявіч', 'Яўгеньявіч',
        'Сяргеявіч', 'Іванавіч', 'Фёдаравіч', 'Львовіч', 'Владзіміравіч',
        'Барысывіч', 'Максімавіч',
    );

    protected static $middleNameFemale = array(
        'Аляксандраўна', 'Аляксеяўна', 'Андрэяўна', 'Дзмітрыеўна', 'Яўгеньяўна',
        'Сяргеяўна', 'Іванаўна', 'Фёдараўна', 'Львоўна', 'Владзіміраўна',
        'Барысаўна', 'Максімаўна',
    );

    /**
     * {@link} http://ru.wikipedia.org/wiki/%D0%A1%D0%BF%D0%B8%D1%81%D0%BE%D0%BA_%D0%BE%D0%B1%D1%89%D0%B5%D1%80%D1%83%D1%81%D1%81%D0%BA%D0%B8%D1%85_%D1%84%D0%B0%D0%BC%D0%B8%D0%BB%D0%B8%D0%B9
     **/
    protected static $lastName = array(
        'Мурашко','Бойко','Грамыко','Прыходзько','Мялешко','Лойко','Сянько','Сушко','Вялічко','Валадзько','Дудко','Сямашко',
        'Дайнеко','Цвірко','Терашко','Савко','Манько','Ломако','Шышко','Будзько','Санько','Бабко','Буцько','Ладуцько',
        'Гарошко','Зелянко','Галаўко','Шыбеко',
    );

    protected static $lastNameSuffix = array('', '');

    /**
     * Return male middle name
     *
     * @example 'Иванович'
     *
     * @access public
     *
     * @return string Middle name
     */
    public function middleNameMale()
    {
        return static::randomElement(static::$middleNameMale);
    }

    /**
     * Return female middle name
     *
     * @example 'Ивановна'
     *
     * @access public
     *
     * @return string Middle name
     */
    public function middleNameFemale()
    {
        return static::randomElement(static::$middleNameFemale);
    }

    /**
     * Return middle name for the specified gender.
     *
     * @access public
     * @param string|null $gender A gender the middle name should be generated
     *     for. If the argument is skipped a random gender will be used.
     * @return string Middle name
     */
    public function middleName($gender = null)
    {
        if ($gender === static::GENDER_MALE) {
            return $this->middleNameMale();
        } elseif ($gender === static::GENDER_FEMALE) {
            return $this->middleNameFemale();
        }

        return $this->middleName(static::randomElement(array(
            static::GENDER_MALE,
            static::GENDER_FEMALE,
        )));
    }

    /**
     * Return last name for the specified gender.
     *
     * @param string|null $gender A gender of the last name should be generated
     *     for. If the argument is skipped a random gender will be used.
     * @return string Last name
     */
    public function lastName($gender = null)
    {
        $lastName = static::randomElement(static::$lastName);

        if (static::GENDER_FEMALE === $gender) {
            return $lastName . 'a';
        } elseif (static::GENDER_MALE === $gender) {
            return $lastName;
        }

        return $lastName . static::randomElement(static::$lastNameSuffix);
    }

}
